export const getMessageInfo = (status: number | string) => {
  const statusMap: Record<number | string, string> = {
    200: "请求成功",
    201: "请求成功并创建了新资源",
    202: "服务器已接受请求，但尚未处理",
    204: "服务器成功处理了请求，但不需要返回任何实体内容",
    400: "请求无效",
    401: "请求要求用户的身份认证",
    403: "服务器拒绝请求",
    404: "服务器找不到请求的资源",
    405: "请求方法不被允许",
    406: "请求的资源的内容特性无法满足请求头中的条件",
    408: "请求超时",
    409: "由于和被请求的资源的当前状态之间存在冲突，请求无法完成",
    410: "被请求的资源在服务器上已经不再可用",
    413: "请求实体过大",
    414: "请求的URI过长",
    415: "不支持的媒体类型",
    500: "服务器内部错误",
    501: "服务器不具备完成请求的功能",
    502: "错误网关",
    503: "服务不可用",
    504: "网关超时",
    505: "HTTP版本不受支持",
  };
  return statusMap[status] || "未知错误";
};